src/cf/Catalogs/fmDepartments.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>fmDepartments</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DepartmentType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDepartmentTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Color</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SetColor</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>StructureVersion</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDepartmentsStructuresVersions</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BalanceUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmBalanceUnits</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ManageType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmManagementTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.AdditionalAttributesAndInfo</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TextString</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/fmDepartmentHierarchy.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>fmDepartmentHierarchy</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Level</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DeletionMark</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDepartments</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>DepartmentParent</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDepartments</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>StructureVersion</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDepartmentsStructuresVersions</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/fmDepartmentsState.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>fmDepartmentsState</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>DepartmentType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDepartmentTypes</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>BalanceUnit</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmBalanceUnits</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Department</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.fmDepartments</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/fmDepartments/Ext/ObjectModule.bsl
Var mIsNew; // Для определения при записи элемента новый или нет.
Var mOldBalanceUnit;
Var mOldDepartmentType;
Var mOldParent;
Var mParent;
Var mOldResponsible;

#If Server OR ThickClientOrdinaryApplication OR ExternalConnection Then

Procedure BeforeWrite(Cancel)
	
	mIsNew = IsNew();
	mOldBalanceUnit = Ref.BalanceUnit;
	mOldDepartmentType = Ref.DepartmentType;
	mOldParent = Ref.Parent;
	mOldResponsible = Ref.Responsible;
	mParent = Parent;
	
	If NOT fmBudgeting.ReturnDepartmentStructureActualVersion()=StructureVersion Then
		Parent = mOldParent;
	EndIf;
	
EndProcedure

Procedure OnWrite(Cancel)
	
	If mIsNew AND ValueIsFilled(StructureVersion) Then
		NewRecord = InformationRegisters.fmDepartmentHierarchy.CreateRecordManager();
		NewRecord.StructureVersion = StructureVersion;
		NewRecord.Department = Ref;
		NewRecord.DepartmentParent = mParent;
		NewRecord.Level = fmBudgeting.ReturnParentLevelFromIR(mParent, StructureVersion) + 1;
		Try
			NewRecord.Write();
		Except
			CommonClientServer.MessageToUser(NStr("en='Failed to save a new department to the hierarchy';ru='Не удалось записать новое подразделение в иерархию'"),,,,Cancel);
		EndTry;
	EndIf;
	
	If mOldDepartmentType<>DepartmentType OR mOldBalanceUnit<>BalanceUnit OR mOldResponsible <> Responsible Then
		//Проверим, изменялись ли периодические реквизиты за текущий месяц для данного подразделения
		DepartmentsState = InformationRegisters.fmDepartmentsState.CreateRecordManager();
		DepartmentsState.Department = Ref;
		DepartmentsState.DepartmentType = DepartmentType;
		DepartmentsState.BalanceUnit = BalanceUnit;
		DepartmentsState.Responsible = Responsible;
		DepartmentsState.Period = CurrentSessionDate();
		Try
			DepartmentsState.Write();
		Except
			CommonClientServer.MessageToUser(NStr("en='Failed to save changes in the department status';ru='Не удалось записать изменения в состоянии подразделения'"),,,,Cancel);
		EndTry;
	EndIf;
	
	If NOT mIsNew AND (mOldParent<>mParent OR mOldResponsible<>Responsible OR mOldBalanceUnit<>BalanceUnit) Then
		NewRecord = InformationRegisters.fmDepartmentHierarchy.CreateRecordSet();
		NewRecord.Filter.StructureVersion.Set(StructureVersion);
		NewRecord.Filter.Department.Set(Ref);
		NewRecord.Read();
		NewRecord[0].DepartmentParent = mParent;
		Try
			NewRecord.Write();
		Except
			CommonClientServer.MessageToUser(NStr("en='Failed to change a department in the hierarchy';ru='Не удалось изменить подразделение в иерархии'"),,,,Cancel);
		EndTry;
	EndIf;
EndProcedure

Procedure Filling(FillingData, FillingText, StandardProcessing)
	BalanceUnit = fmCommonUseServer.GetDefaultValue("MainBalanceUnit");
	StructureVersion = fmBudgeting.ReturnDepartmentStructureActualVersion();
EndProcedure

#EndIf
